ERP.belugaerp/src/Documents/битФакторинг/битФакторинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битФакторинг</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_ОперацииПоФакторингу</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.бг_ВидыОперацийФакторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Фактор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорФактора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчетаКонтрагента</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчетаФактора</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяАктивовЗадолженностьКлиентов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыРеализации</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервичныйДокумент</name>
      <type>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФинансирования</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия1</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия2</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия3</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБезНДС1</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияНДС1</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБезНДС2</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияНДС2</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБезНДС3</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияНДС3</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогашенияФинансирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСуммаСчетФактуры</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Enums/бг_ВидыОперацийФакторинга/бг_ВидыОперацийФакторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВидыОперацийФакторинга</name>
  <enumValues>
    <name>ПродажаДебитору</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДокументовФакторуНаФинансирование</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДокументовФакторуПодПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ФинансированиеФактором</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДебиторомФактору</name>
  </enumValues>
  <enumValues>
    <name>ПереводОстаткаФактором</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеФактора</name>
  </enumValues>
  <enumValues>
    <name>ОплатаНамиФактору</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеФинансирования</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДебитораНам</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/битФакторинг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.бг_ВидыОперацийФакторинга.ФинансированиеФактором Тогда
		СуммаДокумента = ДокументыРеализации.Итог("СуммаФинансирования");
	ИначеЕсли ВидОперации = Перечисления.бг_ВидыОперацийФакторинга.ПереводОстаткаФактором Тогда
		СуммаДокумента = ДокументыРеализации.Итог("Остаток");
	ИначеЕсли ВидОперации = Перечисления.бг_ВидыОперацийФакторинга.ВознаграждениеФактора Тогда
		СуммаДокумента = ДокументыРеализации.Итог("Комиссия1") + ДокументыРеализации.Итог("Комиссия2")
			+ ДокументыРеализации.Итог("Комиссия3");
	Иначе
		СуммаДокумента = ДокументыРеализации.Итог("Сумма");
	КонецЕсли;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура бг_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если Не ВидОперации = Перечисления.бг_ВидыОперацийФакторинга.ПередачаДокументовФакторуНаФинансирование
		И Не ВидОперации = Перечисления.бг_ВидыОперацийФакторинга.ПередачаДокументовФакторуПодПлатеж Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходов");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяДоходов");
		
	КонецЕсли;
	
	ОперацииВзаимодействияСКорСтатьей = Новый Массив;
	ОперацииВзаимодействияСКорСтатьей.Добавить(
		Перечисления.бг_ВидыОперацийФакторинга.ПередачаДокументовФакторуНаФинансирование);
	ОперацииВзаимодействияСКорСтатьей.Добавить(
		Перечисления.бг_ВидыОперацийФакторинга.ПередачаДокументовФакторуПодПлатеж);
	ОперацииВзаимодействияСКорСтатьей.Добавить(
		Перечисления.бг_ВидыОперацийФакторинга.ОплатаДебитораНам);
	ОперацииВзаимодействияСКорСтатьей.Добавить(
		Перечисления.бг_ВидыОперацийФакторинга.ОплатаДебиторомФактору);
	Если ОперацииВзаимодействияСКорСтатьей.Найти(ВидОперации) = Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КорСтатьяАктивовЗадолженностьКлиентов");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.битФакторинг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДД.ВидОперации КАК ВидОперации,
		|	ДД.Организация КАК Организация,
		|	ДД.Фактор КАК Фактор,
		|	ДД.ДоговорФактора КАК ДоговорФактора,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтавкаНДС КАК СтавкаНДС,
		|	ДД.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ДД.СтатьяДоходов КАК СтатьяДоходов,
		|	ДД.СтатьяРасходов КАК СтатьяРасходов,
		|	ДД.КорСтатьяАктивовЗадолженностьКлиентов КАК КорСтатьяАктивовЗадолженностьКлиентов,
		|	ДД.ГруппаФинансовогоУчетаКонтрагента КАК ГруппаФинансовогоУчетаКонтрагента
		|ИЗ
		|	Документ.битФакторинг КАК ДД
		|ГДЕ
		|	ДД.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.бг_ВидыОперацийФакторинга.ОплатаДебиторомФактору
		И Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Организация, Дата);
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	ЗаполнитьПоляПоУмолчанию();
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ЗаполнитьПоляПоУмолчанию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДД.Ссылка КАК Ссылка,
	|	ДД.КорСтатьяАктивовЗадолженностьКлиентов КАК КорСтатьяАктивовЗадолженностьКлиентов
	|ИЗ
	|	Документ.битФакторинг КАК ДД
	|ГДЕ
	|	ДД.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДД.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Проведен", Проведен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "КорСтатьяАктивовЗадолженностьКлиентов");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
